src/resources/soap.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:GetElectricServiceAgreementExpiryDate>
         <!--Optional:-->
         <tem:AccountID></tem:AccountID>
      </tem:GetElectricServiceAgreementExpiryDate>
   </soapenv:Body>
</soapenv:Envelope>